package 数据结构与算法.LeetCode题解.回溯_递归_记忆化搜索;

import java.util.List;
import java.util.Vector;

/**
 * （补充）经典的八皇后问题（困难）
 设计一种算法，打印 N 皇后在 N × N 棋盘上的各种摆法，
 其中每个皇后都不同行、不同列，也不在对角线上。
 这里的“对角线”指的是所有的对角线，不只是平分整个棋盘的那两条对角线。

 *每一种解法包含一个明确的 n 皇后问题的棋子放置方案，
 * 该方案中 'Q' 和 '.' 分别代表了皇后和空位。
 *
 * 示例:
 *
 *  输入：4
 *  输出：[[".Q..","...Q","Q...","..Q."],["..Q.","Q...","...Q",".Q.."]]
 *  解释: 4 皇后问题存在如下两个不同的解法。
 * [
 *  [".Q..",  // 解法 1
 *   "...Q",
 *   "Q...",
 *   "..Q."],
 *
 *  ["..Q.",  // 解法 2
 *   "Q...",
 *   "...Q",
 *   ".Q.."]
 * ]
 *
 */
public class 八皇后问题 {
}
